<?php

declare(strict_types=1);

return [
    'unavailable' => [
        'label' => 'Статус',
        'content' => 'Недоступный',
    ],
    'live' => [
        'label' => 'Живой',
        'yes' => 'Да',
        'no' => 'Нет',
    ],
    'gender' => [
        'label' => 'Пол',
    ],
    'surname' => [
        'label' => 'Фамилия',
        'null' => '?Фамилия?',
    ],
    'old_surname' => [
        'label' => 'Прежние фамилии',
        'name' => [
            'label' => 'фамилия',
        ],
        'order' => [
            'label' => 'порядковый номер',
            'rule' => 'неповторяющееся число больше единицы',
            'help' => 'порядковые номера изменения фамилии',
        ],
    ],
    'name' => [
        'label' => 'Имя',
        'null' => '?Имя?',
    ],
    'patronymic' => [
        'label' => 'Отчество',
        'null' => '?Отчество?',
        'rule' => 'при отсутствии отчества поставьте символ ! (восклицательного знака), оставьте строку пустой, если данные об отчестве неизвестны',
    ],
    'birth_date' => [
        'label' => 'Дата рождения',
        'age' => '(:age)',
    ],
    'birth_place' => [
        'label' => 'Место рождения',
    ],
    'death_date' => [
        'label' => 'Дата смерти',
        'interval' => [
            'short' => '(:death назад)',
            'long' => '(:death назад в возрасте :age)',
        ],
    ],
    'burial_place' => [
        'label' => 'Место захоронения',
    ],
    'note' => [
        'label' => 'Примечание',
    ],
    'activities' => [
        'label' => 'Вид деятельности',
    ],
    'emails' => [
        'label' => 'Электронная почта',
    ],
    'internet' => [
        'label' => 'Интернет ресурсы',
        'name' => [
            'label' => 'Наименование',
            'help' => 'например соцальная сеть',
        ],
        'url' => [
            'label' => 'url адрес',
            'help' => 'например адрес страницы в соцальной сети',
        ],
    ],
    'phones' => [
        'label' => 'Телефоны',
        'rule' => 'цифры, без тире и символа плюс',
    ],
    'residences' => [
        'label' => 'Места проживания',
        'name' => [
            'label' => 'Адрес',
        ],
        'date' => [
            'label' => 'Дата актуальности данных',
            'content' => '(данные актуальны на :date)',
        ],
    ],
    'parents' => [
        'label' => 'Родители',
        'role' => [
            'label' => 'Роль родителя',
        ],
        'person' => [
            'label' => 'Лицо',
        ],
    ],
    'marriages' => [
        'label' => 'Брак (сожительство)',
        'role_current' => [
            'label' => 'Роль текущего лица',
        ],
        'role_soulmate' => [
            'label' => 'Роль партнера',
        ],
        'soulmate' => [
            'label' => 'Имя партнера',
        ],
    ],
    'children' => [
        'label' => 'Дети',
    ],
    'brothers_sisters' => [
        'label' => 'Братья, сёстры',
    ],
    'photo' => [
        'label' => 'Фото',
        'date' => [
            'label' => 'Дата снимка',
        ],
        'order' => [
            'label' => 'Порядковый номер',
            'rule' => 'неповторяющееся число больше единицы',
            'help' => 'укажите порядковый номер фотоснимка',
        ],
        'adding' => 'Для добавления фото выбирите файл',
        'missing' => 'Фото отсутствует',
    ],
    'date' => [
        'rule' => 'оставьте строку пустой, если дата неизвестна, иначе дата должна соответствовать формату гггг-мм-дд, любая неизвестная цифра заменяется символом ? (вопросительного знака)',
    ],
    'crud' => [
        'show' => 'Открыть карточку',
        'create' => 'Создать',
        'store' => 'Сохранить',
        'edit' => 'Редактировать',
        'update' => 'Обновить',
        'destroy' => 'Удалить',
        'close' => 'Закрыть',
        'list_input' => [
            'add' => 'Добавить',
            'del' => 'Удалить',
        ],
        'message' => [
            'ok' => [
                'save' => 'Лицо успешно сохранено',
                'store' => 'Лицо успешно создано',
                'update' => 'Данные успешно обновлены',
                'destroy' => 'Лицо успешно удалено',
            ],
            'error' => [
                'not_valid' => 'Неправильно заполнены поля формы',
                'common' => 'Произошла ошибка, попробуйте снова, если ошибка будет повторяться обратитесь к разработчику',
            ],
            'confirmation' => 'Отмена действия невозможна, продлжить?',
        ],
    ],
];
